Тест/Тест/src/Documents/ЗаявкаЗакупкаТовара/ЗаявкаЗакупкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаЗакупкаТовара</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаряд</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупленныйТовар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производитель</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВЗаказНаряде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/ЗаявкаЗакупкаТовара/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд")  Тогда
		
		ЗаказНаряд = ДанныеЗаполнения;  
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказНарядДефектовочныйЛист.Номенклатура КАК Товар,
			|	ЗаказНарядДефектовочныйЛист.Количество КАК Количество,
			|	ЗаказНарядДефектовочныйЛист.Цена КАК ЦенаВЗаказНаряде,
			|	ЗаказНарядДефектовочныйЛист.Комментарий КАК Комментарий
			|ИЗ
			|	Документ.ЗаказНаряд.ДефектовочныйЛист КАК ЗаказНарядДефектовочныйЛист
			|ГДЕ
			|	ЗаказНарядДефектовочныйЛист.Ссылка = &СсылкаЗакНар
			|	И ЗаказНарядДефектовочныйЛист.Остаток = ""Нет на складе""";
		
		Запрос.УстановитьПараметр("СсылкаЗакНар",ЗаказНаряд);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		ЗакупленныйТовар.Загрузить(РезультатЗапроса);
		
		Для каждого Строка ИЗ ЗакупленныйТовар Цикл 
			Строка.Сумма = Строка.ЦенаВЗаказНаряде * Строка.Количество; 
			СуммаДокумента = СуммаДокумента	+ (Строка.ЦенаВЗаказНаряде * Строка.Количество);
		КонецЦикла;
			
	КонецЕСли; 
	КонецПроцедуры
